Franklin0111/gmp_pro/csp/c28x_syscfg/iris_280039c_board/F280039_Iris_node.syscfg
inputxbar_input1.$name         = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarGpio = "GPIO47";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO34";

other1.useCase                   = "CUSTOM";
other1.useInterfacePins          = ["ADCSOCAO","SYNCOUT","TDI","TDO","X1","XCLKOUT","XRSn"];
other1.$name                     = "OTHER_PIN_DEFINITION";
other1.other.$assign             = "OTHER";
other1.other.adcsocaoPin.$assign = "GPIO8";
other1.other.syncoutPin.$assign  = "GPIO6";
other1.other.xclkoutPin.$assign  = "GPIO18, X2";
other1.other.tdoPin.$assign      = "GPIO37/TDO";
other1.other.tdiPin.$assign      = "GPIO35/TDI";
other1.other.x1Pin.$assign       = "GPIO19, X1";

sci1.enabledFIFOInterrupts      = ["SCI_INT_RXFF"];
sci1.selectRegisteredInterrupts = ["registerRxInt"];
sci1.$name                      = "IRIS_UART_RS232";
sci1.sci.$assign                = "SCIA";
sci1.sci.sci_rxPin.$assign      = "GPIO9";
sci1.sci.sci_txPin.$assign      = "GPIO48";
sci1.rxQual.$name               = "myGPIOQUAL0";
sci1.txQual.$name               = "myGPIOQUAL1";

sci2.$name                      = "IRIS_UART_USB";
sci2.enabledFIFOInterrupts      = ["SCI_INT_RXFF"];
sci2.selectRegisteredInterrupts = ["registerRxInt"];
sci2.enabledErrorInterrupts     = ["SCI_INT_FE","SCI_INT_OE"];
sci2.rxFifo                     = "SCI_FIFO_RX14";
sci2.baudRates                  = 921600;
sci2.sci.$assign                = "SCIB";
sci2.sci.sci_rxPin.$assign      = "GPIO41";
sci2.sci.sci_txPin.$assign      = "GPIO10";
sci2.rxQual.$name               = "myGPIOQUAL6";
sci2.txQual.$name               = "myGPIOQUAL7";
sci2.sciRXInt.enableInterrupt   = true;

spi1.$name          = "IRIS_SPI_FPGA_BRIDGE";
spi1.emulationMode  = "SPI_EMULATION_FREE_RUN";
spi1.mode           = "SPI_MODE_CONTROLLER";
spi1.useInterrupts  = false;
spi1.useHSMode      = true;
spi1.bitRate        = 15000000;
spi1.spi.$assign    = "SPIA";
spi1.picoQual.$name = "myGPIOQUAL2";
spi1.pociQual.$name = "myGPIOQUAL3";
spi1.clkQual.$name  = "myGPIOQUAL4";
spi1.pteQual.$name  = "myGPIOQUAL5";

spi2.$name                   = "IRIS_SPI_OUT";
spi2.spi.spi_picoPin.$assign = "GPIO60";
spi2.spi.spi_pociPin.$assign = "GPIO25";
spi2.spi.spi_clkPin.$assign  = "GPIO32";
spi2.spi.spi_ptePin.$assign  = "GPIO27";
spi2.picoQual.$name          = "myGPIOQUAL8";
spi2.pociQual.$name          = "myGPIOQUAL9";
spi2.clkQual.$name           = "myGPIOQUAL10";
spi2.pteQual.$name           = "myGPIOQUAL11";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
fsi1.fsiRx.fsirx.$suggestSolution              = "FSIRXA";
fsi1.fsiRx.fsirx.fsirx_d0Pin.$suggestSolution  = "GPIO52";
fsi1.fsiRx.fsirx.fsirx_d1Pin.$suggestSolution  = "GPIO53";
fsi1.fsiRx.fsirx.fsirx_clkPin.$suggestSolution = "GPIO54";
fsi1.fsiTx.fsitx.$suggestSolution              = "FSITXA";
fsi1.fsiTx.fsitx.fsitx_d0Pin.$suggestSolution  = "GPIO49";
fsi1.fsiTx.fsitx.fsitx_d1Pin.$suggestSolution  = "GPIO50";
fsi1.fsiTx.fsitx.fsitx_clkPin.$suggestSolution = "GPIO51";
epwm1.epwm.$suggestSolution                    = "EPWM2";
epwm1.epwm.epwm_aPin.$suggestSolution          = "GPIO2";
epwm1.epwm.epwm_bPin.$suggestSolution          = "GPIO3";
spi1.spi.spi_picoPin.$suggestSolution          = "GPIO16";
spi1.spi.spi_pociPin.$suggestSolution          = "GPIO17";
spi1.spi.spi_clkPin.$suggestSolution           = "GPIO12";
spi1.spi.spi_ptePin.$suggestSolution           = "GPIO11";
spi2.spi.$suggestSolution                      = "SPIB";
